{
    "title": "quiz—08-english-reading-comprehension",
    "time": 1800,
    "passage": true,
    "dataSet": [
        {
            "string": "Reading passage- 01<br/>Read the following passage and answer the questions according to it.<br/><center><b>Video Games</b></center>"
        },
        {
            "string": "Although video games were first developed for adults, they are no longer exclusively reserved for the grown-ups in the home. In 2006, Rideout and Hamel reported that as many as 29 percent of preschool children (children between two and six years old) in the United States had played console video games, and 18 percent had played handheld ones. Given young children’s insatiable eagerness to learn, coupled with the fact that they are clearly surrounded by these media, we predict that preschoolers will both continue and increasingly begin to adopt video games for personal enjoyment Although the majority of gaming equipment is still designed for a much older target audience, once a game system enters the household it is potentially available for all family members, including the youngest. Portable systems have done a particularly good job of penetrating the younger market. Research in the video game market is typically done at two stages: sometimes close to the end of the product cycle, in order to get feedback from consumers, so that a marketing strategy can be developed; and at the very end of the product cycle to ‘fix bugs’ in the game. While both of those types of research are important and may be appropriate for dealing with adult consumers, neither of them aids in designing better games, especially when it comes to designing for an audience that may have particular needs, such as preschoolers or senior citizens. Instead, exploratory and formative research has to be undertaken in order to truly understand those audiences, their abilities, their perspective, and their needs. In the spring of 2007, our preschool-game production team at Nickelodeon had a hunch that the Nintendo DS* — with its new features, such as the microphone, small size and portability, and its relatively low price point — was a ripe gaming platform for preschoolers. There were a few games on the market at the time which had characters that appealed to the younger set, but our game producers did not think that the game mechanics or design were appropriate for preschoolers. What exactly preschoolers could do with the system, however, was a bit of a mystery. So we set about doing a study to answer the query: What could we expect preschoolers to be capable of in the context of hand-held gameplay, and how might the child development literature inform us as we proceeded with the creation of a new outlet for this age group? Our context, in this case, was the United States, although the games that resulted were also released in other regions, due to the broad international reach of the characters. In order to design the best possible DS product for a preschool audience we were fully committed to the ideals of a ‘user-centered approach’, which assumes that users will be at least considered, but ideally consulted during the development process. After all, when it comes to introducing a new interactive product to the child market, and particularly such a young age group within it, we believe it is crucial to assess the range of physical and cognitive abilities associated with their specific developmental stage. Revelle and Medoff (2002) review some of the basic reasons why home entertainment systems, computers, and other electronic gaming devices, are often difficult for preschoolers to use. In addition to their still-developing motor skills (which make manipulating a controller with small buttons difficult), many of the major stumbling blocks are cognitive. Though preschoolers are learning to think symbolically and understand that pictures can stand for real-life objects, the vast majority are still unable to read and write. Thus, using text-based menu selections is not viable. Mapping is yet another obstacle since preschoolers may be unable to understand that there is a direct link between how the controller is used and the activities that appear before them on screen. Though this aspect is changing, in traditional mapping systems real-life movements do not usually translate into game-based activity. Over the course of our study, we gained many insights into how preschoolers interact with various platforms, including the DS. For instance, all instructions for preschoolers need to be in voiceover and include visual representations, and this has been one of the most difficult areas for us to negotiate with respect to game design on the DS. Because the game cartridges have very limited memory capacity, particularly in comparison to console or computer games, the ability to capture large amounts of voiceover data via sound files or visual representations of instructions becomes limited. Text instructions take up minimal memory, so they are preferable from a technological perspective. Figuring out ways to maximize sound and graphics files, while retaining the clear visual and verbal cues that we know are critical for our youngest players, is a constant give and take. Another of our findings indicated that preschoolers may use either a stylus, or their fingers, or both although they are not very accurate with either. One of the very interesting aspects of the DS is that the interface, which is designed to respond to stylus interactions, can also effectively be used with the tip of the finger. This is particularly noteworthy in the context of preschoolers for two reasons. Firstly, as they have trouble with fine motor skills and their hand-eye coordination is still in development, they are less exact with their stylus movements; secondly, their fingers are so small that they mimic the stylus very effectively, and therefore by using their fingers they can often be more accurate in their game interactions."
        },
        {
            "string": "Questions 1-5<br/>Do the following statements agree with the claims of the writer in Reading Passage?<br/>YES If the statement agrees with the views of the writer<br/>NO If the statement contradicts the views of the writer<br/>NOT GIVEN If it is impossible to say what the writer thinks about it"
        },
        {
            "questions": [
                [
                    "Video game use amongst preschool children is higher in the US than in other countries.",
                    "True",
                    "False",
                    "Not Given"
                ],
                [
                    "The proportion of preschool children using video games is likely to rise.",
                    "True",
                    "False",
                    "Not Given"
                ],
                [
                    "Parents in the US who own gaming equipment generally allow their children to play with it.",
                    "True",
                    "False",
                    "Not Given"
                ],
                [
                    "The type of research that manufacturers usually do is aimed at improving the game design.",
                    "True",
                    "False",
                    "Not Given"
                ],
                [
                    "Both old and young game consumers require research that is specifically targeted.",
                    "True",
                    "False",
                    "Not Given"
                ]
            ]
        },
        {
            "string": "Questions 6-10<br/>Choose the correct letter, A, B, C, D or E."
        },
        {
            "questions": [
                [
                    "In 2007, what conclusion did games producers at Nickelodeon come to?",
                    "The preschool market was unlikely to be sufficiently profitable.",
                    "One of their hardware products would probably be suitable for preschoolers.",
                    "Games produced by rival companies were completely inappropriate for preschoolers.",
                    "They should put their ideas for new games for preschoolers into practice.",
                    "For personal enjoyment."
                ],
                [
                    "The study carried out by Nickelodeon",
                    "was based on children living in various parts of the world.",
                    "focused on the kinds of game content which interests preschoolers.",
                    "investigated the specific characteristics of the target market.",
                    "led to products which appealed mainly to US consumers.",
                    "They wanted to make some interesting things for children."
                ],
                [
                    "Which problem do the writers highlight concerning games instructions for young children?",
                    "Spoken instructions take up a lot of the available memory.",
                    "Written instructions have to be expressed very simply.",
                    "The children do not follow instructions consistently.",
                    "The video images distract attention from the instructions.",
                    "The children always follow the instructions."
                ],
                [
                    "Which is the best title for Reading Passage 3?",
                    "An overview of video games software for the preschool market",
                    "Researching and designing video games for preschool children",
                    "The effects of video games on the behavior of young children",
                    "Assessing the impact of video games on educational achievement",
                    "Disadvantages of video games"
                ],
                [
                    "'Retain' Used As-",
                    "verb",
                    "adjective",
                    "noun",
                    "adverb",
                    "noun"
                ]
            ]
        },
        {
            "string": "Reading Passage - 02<br/>Read the following passage thoroughly and answer the questions according to passage 2.<br/><center><b>The Significant Role of Mother Tongue in Education</b></center>"
        },
        {
            "string": "One consequence of population mobility is increasing diversity within schools. To illustrate, in the city of Toronto in Canada, 58% of kindergarten pupils come from homes where English is not the usual language of communication. Schools in Europe and North America have experienced this diversity for years, and educational policies and practices vary widely between countries and even within countries. Some political parties and groups search for ways to solve the problem of diverse communities and their integration into schools and society. However, they see few positive consequences for the host society and worry that this diversity threatens the identity of the host society. Consequently, they promote unfortunate educational policies that will make the “problem” disappear. If students retain their culture and language, they are viewed as less capable of identifying with the mainstream culture and learning the mainstream language of society.<br/>The challenge for educators and policy-makers is to shape the evolution of national identity in such a way that the rights of all citizens (including school children) are respected, and the cultural, linguistic, and economic resources of the nation are maximized. To waste the resources of the nation by discouraging children from developing their mother tongues is quite simply unintelligent from the point of view of national self-interest. A first step in providing an appropriate education for culturally and linguistically diverse children is to examine what the existing research says about the role of children’s mother tongues in their educational development.<br/>In fact, the research is very clear. When children continue to develop their abilities in two or more languages throughout their primary school, they gain a deeper understanding of language and how to use it effectively. They have more practice in processing language, especially when they develop literacy in both. More than 150 research studies conducted during the past 35 years strongly support what Goethe, the famous eighteenth-century German philosopher, once said: the person who knows only one language does not truly know that language. Research suggests that bilingual children may also develop more flexibility in their thinking as a result of processing information through two different languages.<br/>The level of development of children’s mother tongue is a strong predictor of their second language development. Children who come to school with a solid foundation in their mother tongue develop stronger literacy abilities in the school language. When parents and other caregivers (e.g. grandparents) are able to spend time with their children and tell stories or discuss issues with them in a way that develops their mother tongue, children come to school well-prepared to learn the school language and succeed educationally. Children’s knowledge and skills transfer across languages from the mother tongue to the school language. Transfer across languages can be two-way: both languages nurture each other when the educational environment permits children access to both languages.<br/>Some educators and parents are suspicious of mother-tongue-based teaching programs because they worry that they take time away from the majority language. For example, in a bilingual program where 50% of the time is spent teaching through children’s home language and 50% through the majority language, surely children won’t progress as far in the latter? One of the most strongly established findings of educational research, however, is that well-implemented bilingual programs can promote literacy and subject-matter knowledge in a minority language without any negative effects on children’s development in the majority language. Within Europe, the Foyer program in Belgium, which develops children’s speaking and literacy abilities in three languages (their mother tongue, Dutch and French), most clearly illustrate the benefits of bilingual and trilingual education (see Cummins, 2000).<br/>It is easy to understand how this happens. When children are learning through a minority language, they are learning concepts and intellectual skills too. Pupils who know how to tell the time in their mother tongue and understand the concept of telling time. In order to tell the time in the majority language, they do not need to re-learn the concept. Similarly, at more advanced stages, there is a transfer across languages in other skills such as knowing how to distinguish the main idea from the supporting details of a written passage or story and distinguishing fact from opinion. Studies of secondary school pupils are providing interesting findings in this area, and it would be worth extending this research.<br/>Many people marvel at how quickly bilingual children seem to “pick up” conversational skills in the majority language at school (although it takes much longer for them to catch up with native speakers in academic language skills). However, educators are often much less aware of how quickly children can lose their ability to use their mother tongue, even in the home context. The extent and rapidity of language loss will vary according to the concentration of families from a particular linguistic group in the neighborhood. Where the mother tongue is used extensively in the community, then language loss among children will be less. However, where language communities are not concentrated in particular neighborhoods, children can lose their ability to communicate in their mother tongue within 2-3 years of starting school. They may retain receptive skills in the language but they will use the majority language in speaking with their peers and siblings and in responding to their parents. By the time children become adolescents, the linguistic division between parents and children has become an emotional chasm. Pupils frequently become alienated from the cultures of both home and school with predictable results."
        },
        {
            "string": "Questions 1-5<br/>Choose the correct letter, A, B, C, D, or E."
        },
        {
            "questions": [
                [
                    "What point did the writer make in the second paragraph?",
                    "Some present studies on children’s mother tongues are misleading.",
                    "A culturally rich education program benefits some children more than others.",
                    "Bilingual children can make a valuable contribution to the wealth of a country.",
                    "The law on mother tongue use at school should be strengthened. E. Both BandC"
                ],
                [
                    "Why does the writer refer to something that Goethe said?",
                    "to lend weight to his argument",
                    "to contradict some research",
                    "to introduce a new concept",
                    "to update current thinking",
                    "to gain more knowledge"
                ],
                [
                    "The writer believes that when young children have a firm grasp of their mother tongue",
                    "they can teach older family members what they learned at school.",
                    "they go on to do much better throughout their time at school.",
                    "they can read stories about their cultural background.",
                    "they develop stronger relationships with their family than with their peers.",
                    "Both C and D"
                ],
                [
                    "Why are some people skeptical about mother tongue-based teaching programs?",
                    "They worry that children will be slow to learn to read in either language.",
                    "They think that children will confuse words in two languages.",
                    "They believe that the programs will make children less interested in their lessons.",
                    "They fear that the programs will use up valuable time during the school day.",
                    "Neither is the answer."
                ],
                [
                    "Why does the writer refer to something that Mobility said?",
                    "smartphone",
                    "digital transportation",
                    "eloquent",
                    "sticky",
                    "move freely"
                ]
            ]
        },
        {
            "string": "Questions 16-20<br/>Do the following statements agree with the views of the writer in the Reading passage ?<br/>YES If the statement agrees with the views of the writer<br/>NO If the statement contradicts the views of the writer<br/>NOT GIVEN If it is impossible to say what the writer thinks about this"
        },
        {
            "questions": [
                [
                    "Less than half of the children who attend kindergarten in Toronto have English as their mother tongue.",
                    "True",
                    "False",
                    "Not Given"
                ],
                [
                    "Research proves that learning the host country's language at school can have an adverse effect on a child’s mother tongue.",
                    "True",
                    "False",
                    "Not Given"
                ],
                [
                    "The Foyer program is accepted by the French education system.",
                    "True",
                    "False",
                    "Not Given"
                ],
                [
                    "Bilingual children are taught to tell the time earlier than monolingual children.",
                    "True",
                    "False",
                    "Not Given"
                ],
                [
                    "Bilingual children can apply reading comprehension strategies acquired in one language when reading in the other.",
                    "True",
                    "False",
                    "Not Given"
                ]
            ]
        }
    ],
    "answers": [
        "c",
        "a",
        "c",
        "b",
        "a",
        "b",
        "c",
        "a",
        "b",
        "a",
        "c",
        "a",
        "b",
        "d",
        "e",
        "a",
        "c",
        "b",
        "c",
        "a"
    ]
}