{
    "prototype": "FormulaDoc",
    "title": "Subject Verb Agreement",
    "description": "Subject Verb Agreement from basic to advanched",
    "keywords": "subject, verb, agreement",
    "author": "Phoenix Admission Care",
    "dataSet": [
        {
            "title": "phoenix-PDF",
            "serial": true,
            "dataSet": [
                "A subject will come before a phrase beginning with of. This is a key rule for understanding subjects.<br/>The word of is the culprit in many, perhaps most, subject verb mistakes.<br/>Hasty writers, speakers, readers, and listeners might miss the all-toocommon mistake in the following sentence:<br/>Incorrect: A bouquet of yellow roses lend color and fragrance to the room.<br/>Correct: A bouquet of yellow roses lends . . . (bouquet lends, not roses lend) Here the subject \"A bouquet\" is singular.",
                "Two singular subjects connected by or, either/or, or neither/nor require a singular verb.<br/><u>Examples:</u> My aunt or my uncle is arriving by train today.<br/>Neither Juan nor Carmen is available.<br/>Either Kiana or Casey is helping today with stage decorations.",
                "The verb in an or, either/or, or neither/nor sentence agrees with the noun or pronoun closest to it.<br/><u>Examples:</u> Neither the plates nor the serving bowl goes on that shelf.<br/>Neither the serving bowl nor the plates go on that shelf.<br/>This rule can lead to bumps in the road. For example, if I is one of two (or more) subjects, it could lead to this odd sentence:<br/>Awkward: Neither she, my friends, nor I am going to the festival.",
                "As a general rule, use a plural verb with two or more subjects when they are connected by and.<br/><u>Examples:</u> A car and a bike are my means of transportation.<br/>But note these exceptions:<br/>Exceptions: Breaking and entering is against the law.<br/>The bed and breakfast was charming.<br/>In those sentences, breaking and entering and bed and breakfast are compound nouns.",
                "Sometimes the subject is separated from the verb by such words as along with, as well as, besides, not, etc. These words and phrases are not part of the subject. Ignore them and use a singular verb when the subject is singular.<br/><u>Examples:</u> The politician, along with the newsmen, is expected shortly.<br/>Excitement, as well as nervousness, is the cause of her shaking. ",
                "Parentheses are not part of the subject.<br/><u>Examples:</u> Joe (and his trusty mutt) was always welcome.<br/>If this seems awkward, try rewriting the sentence.<br/>(Parentheses: a word or phrase inserted as an explanation or afterthought into a passage which is grammatically complete without it, in writing usually marked off by brackets, dashes, or commas.)",
                "In sentences beginning with here or there, the true subject follows the verb.<br/><u>Examples:</u> There are four hurdles to jump.<br/>There is a high hurdle to jump.<br/>Here are the keys.<br/>NOTE:<br/>The word there's, a contraction of there is, leads to bad habits in informal sentences like There's a lot of people here today, because it's easier to say \"there's\" than \"there are.\" Take care never to use there's with a plural subject.",
                "Use a singular verb with distances, periods of time, sums of money, etc., when considered as a unit.<br/><u>Examples:</u> Three miles is too far to walk.<br/>Five years is the maximum sentence for that offense.<br/>Ten dollars is a high price to pay.<br/>BUT Ten dollars (i.e., dollar bills) were scattered on the floor.",
                "With words that indicate portions—e.g., a lot, a majority, some, all—Rule 1 given earlier in this section is reversed, and we are guided by the noun after of. If the noun after of is singular, use a singular verb. If it is plural, use a plural verb.<br/><u>Examples:</u> A lot of the pie has disappeared.<br/>A lot of the pies have disappeared.<br/>NOTE:<br/>Some teachers, editors, and the SAT testing service, perhaps for convenience, have considered none to be strictly singular. However, authorities agree that none has been both singular and plural since Old English and still is. If in context it seems like a singular to you, use a singular verb; if it seems like a plural, use a plural verb. When none is clearly intended to mean \"not one,\" it is followed by a singular verb.",
                "With collective nouns such as group, jury, family, audience, population, the verb might be singular or plural, depending on the writer's intent.<br/><u>Examples:</u> All of my family has arrived OR have arrived. Most of the jury is here OR are here. A third of the population was not in favor OR were not in favor of the bill.<br/>NOTE:<br/>Anyone who uses a plural verb with a collective noun must take care to be accurate—and also consistent. It must not be done carelessly. The following is the sort of flawed sentence one sees and hears a lot these days: The staff is deciding how they want to vote. Careful speakers and writers would avoid assigning the singular is and the plural they to staff in the same sentence.<br/>Consistent: The staff are deciding how they want to vote. Rewriting such sentences is recommended whenever possible. The preceding sentence would read even better as: The staff members are deciding how they want to vote.",
                "The word were replaced was in sentences that express a wish or are contrary to fact:<br/><u>Examples:</u> If Joe were here, you'd be sorry.<br/>Shouldn't Joe be followed by was, not were, given that Joe is singular? But Joe isn't actually here, so we say were, not was.<br/>The sentence demonstrates the subjunctive mood, which is used to express a hypothetical, wishful, imaginary, or factually contradictory thought.<br/>The subjunctive mood pairs singular subjects with what we usually think of as plural verbs.<br/><u>Examples:</u> I wish it were Friday. She requested that he raise his hand. The foreman demanded that Joe wear safety goggles.<br/>In the first example, a wishful statement, not a fact, is being expressed; therefore, were, which we usually think of as a plural verb, is used with the singular it.<br/>(Technically, it is the singular subject of the object clause in the subjunctive mood: it were Friday.)<br/>Normally, he raise would sound terrible to us. However, in the second example, where a request is being expressed, the subjunctive mood is correct.<br/>Note: The subjunctive mood is losing ground in spoken English but should still be used in formal speech and writing."
            ]
        },
        {
            "title": "practice-here",
            "serial": true,
            "dataSet": [
                "<a href='https://www.grammarbd.com/practice/32/exercise-on-subject-verbagreement-with-explanation' target='_blank'>Grammarbd</a>"
            ]
        },
        {
            "title": "Advanched Rules",
            "serial": true,
            "dataSet": [
                "দুই বা ততোধিক singular subject যদি and দ্বারা যুক্ত হয় তবে উক্ত বাক্যের verb টি plural হয়। <br/>i) Ram and Rahim (to be) two friends. <br/>Ram and Rahim are two friends. <br/>ii) He and his father (to go) to Dhaka. <br/>He and his father go to Dhaka. <br/>iii) Karim and Rahim (to be) present yesterday. <br/>Karim and Rahim were present yesterday.",
                "And দ্বারা যুক্ত দুটি Subject যদি একক সমষ্টিগত ধারনার ইঙ্গিত প্রদান করে তবে উক্ত বাক্যের verb টি singular হয় । <br/>i) Slow and steady (to win ) the race. <br/>Slow and steady wins the race. <br/>ii) The honour and glory of life (to be) character. <br/>The honour and glory of life is character. <br/>iii) Rice and curry (to be) <br/>only food. <br/>Rice and curry is my only food.",
                "কোন বাক্যে subject singular হলে verb singular এবং subject plural হলে verb plural হয়। <br/>i) He (to write) a letter. <br/>He writes a letter. <br/>ii) They (to make) a noise. <br/>They make a noise.",
                "And দ্বারা যুক্ত subject গুলি যদি একই ব্যক্তি বা বস্তুকে বুঝায় তবে উক্ত বাক্যের verb singular হয়। এক্ষেত্রে খেয়াল রাখতে হবে যে, Subject দুটি যদি কারো পদবী বা উপাধি হয় সেক্ষেত্রে উভয় পদবীর বা উপাধির পূর্বে the বসলে বাক্যের verb টি Plural Subject plural এবং প্রথমটির পূর্বে the বসলে এবং ২য় টির পূর্বে the না বসলে verb টি singular হয়। And দ্বারা যুক্ত দুটি subject ভিন্ন ব্যক্তি বা বস্তুকে বুঝালে subject plural হয়। <br/>i) The Headmaster and secretary of the school (to be) present today. <br/>The Headmaster and secretary of the school is present today. <br/>ii) The captain and the Adjutant (to be) present yesterday. <br/>The captain and the Adjutant were present yesterday. <br/>iii) The principal and the chairman (to have) finished the meeting. <br/>The principal and the chairman have finished the meeting.",
                "কোন sentence এর verb উক্ত বাক্যের Subject এর Number ও Person অনুসারে বসে। অর্থাৎ subject singular হলে verb singular এবং sub plural হলে verb plural হয়। <br/>i) The colour of her eyes (to be) blue. <br/>The colour of her eyes is blue. <br/>ii) The players in the field (to be) taking rest. <br/>The players in the field are taking rest.",
                "বাক্যে 'be' ব্যবহার হলে শুধু 1st person singular ও 3rd singular number ছাড়া অন্যান্য ক্ষেত্রে verb এর রূপের তেমন কোন পরিবর্তন হয় না। তবে be verb ছাড়া অন্য verb ব্যবহার হলে sub যদি 3rd person singular number এবং বাক্যটি যদি simple present tense হয় তবে verb এর শেষে s, es, ies, যোগ হয় কিন্তু অন্যান্য ক্ষেত্রে verb এর রূপের তেমন কোন পরিবর্তন হয় না। <br/>i) I am/we are <br/>I am/he is <br/>you are <br/>you are/they are/were <br/>He is/they are<br/>ii) He reads/ I read/ you read/ they read/we read <br/>তবে have verb এর ক্ষেত্রে Third person singular number এর ক্ষেত্রে has এবং অন্যসব person এর ক্ষেত্রে have বসে। যেমনঃ <br/>i) He has, <br/>ii) I have, you have, they have, we have",
                "And দ্বারা যুক্ত দুইটি Singular subject এর পূর্বে যদি each, every, no থাকে তবে উক্ত বাক্যের verb টি singular হয়। <br/>i) Each boy and each girl (to have) a pen. <br/>Each boy and each girl has a pen <br/>ii) Every man and every woman (to be) present. <br/>Every man and every woman is present. <br/>iii) No boy and no girl (to be) absent yesterday. <br/>No boy and no girl was absent yesterday.  <br/>তবে and এর পর not বা no থাকলে verb টি and এর পূর্ববর্তী Subject অনুসারে বসে। <br/>i) Rahman and not his sons (to have) helped me. <br/>Rahman and not his sons has helped me.",
                "As well as, with, along with, together with, in addition to, accompanied by, including with ইত্যাদি দ্বারা কোনো noun বা pronoun যুক্ত হলে উক্ত বাক্যের verb প্রথম subject অনুসারে বসে। <br/>i) Shanta along with her sisters (to have) done the work. <br/>Shanta along with her sisters has done the work. <br/>ii) We along with Karim (to be) present. <br/>We along with Karim are present. <br/>iii) He as well as I (to be) playing. <br/>He as well as I is playing. <br/>iv) Rina together with her father not (to buy) a car yesterday. <br/>Rina together with her father did not buy a car yesterday <br/>v) She with her friends (to be) rewarded. <br/>She with her friends is rewarded. <br/>vi) Either he or his brother (to be) guilty. <br/>Either he or his brother is guilty.",
                "Either _ or, neither _ nor, or, nor, not only, but also দ্বারা দুটি ভিন্ন person এর Subject যুক্ত হয় তবে উক্ত বাক্যের verbটি শেষের Subject অনুসারে৷ এক্ষেত্রে দুটি singular subject যুক্ত হলে verb singular হয়। <br/>i) Every one of them (to have) gone there. <br/>Every one of them has gone there. <br/>ii) <br/>Neither I nor my friends (to have) done it. <br/>Neither I nor my friends have done it. <br/>iii) Not only Karim but also his brothers (to be) present today. <br/>Not only Karim but also his brothers are present today. <br/>iv) Akhi or his friends (to be) absent yesterday. <br/>Akhi or his friends were absent yesterday. <br/>v) <br/>Neither the chairman nor the members (to be) present. <br/>Neither the chairman and the members are present.",
                "Each of _ , either of _, neither of _ , none of _, everybody of _ , everyone of _ , nobody of _ , no girl of _, no boy of ___, ইত্যাদি দ্বারা কোন বাক্য শুরু হলে উক্ত বাক্যের verbটি singular হয়। <br/>ii) Neither of them (to have) passed in the exam. <br/>Neither of them has passed in the exam. <br/>iii) Each of the boys (to get) a prize. <br/>Each of the boys gets a prize.",
                "Many of _ , All of _ , some of ___ ইত্যাদি দ্বারা বাক্য শুরু হলে উক্ত বাক্যের verb টি plural হয়। <br/>i) Many of them (to be) present yesterday. <br/>Many of them were present yesterday. <br/>ii) All of the girls (to have) rewarded. <br/>All of the girls have rewarded.",
                "কোন বাক্যের মধ্যে দুইয়ের অধিক বিভিন্ন noun বা pronoun এর person থাকলে বাক্যের দ্বারা যদি ভাল কাজ বুঝায় তবে উক্ত বাক্যের person নিম্ন অনুসারে বসবে। উক্ত বাক্যের (2 = 2nd person, 3 = 3rd person, 1= 1st person) অনুসারে বসবে। উক্ত বাক্য দ্বারা যদি খারাপ কাজ, দোষের কিছু বোঝায় তবে উক্ত বাক্যের person গুলো হবে ১২৩ অনুসারে। উভয় ক্ষেত্রে বাক্যের verb we অনুসারে বসবে। <br/>i) I, you and he (to be) friends. <br/>You, he and I are friends. <br/>ii) You, he and I ( to be) to blame. <br/>I, you and he are to blame. <br/>iii) Karim, I and you (to be) guilty. <br/>I, you and Karim you are guilty. <br/>iv) She you and I (to have) done it. <br/>You, she and I have done it.",
                "Collective noun এর পরে সাধারণত singular verb বসে। কিন্তু collective noun টি যদি আলাদা আলাদা সত্ত্বা নির্দেশ করে বা noun of multitude বুঝালে তার পরে ব্যবহৃত verb টি plural হয়। <br/>i) The jury (to be) unanimous in its opinion. <br/>The jury is/was unanimious in its opinon. <br/>ii) The jury (to be) divided in their opinions. <br/>The jury are/were divided in their opinions. <br/>iii) The family (to have) been living here for four years. <br/>The family has been living here for four years.  <br/>Noun of multitude: Collective noun এয প্রত্যেক ব্যক্তি বা অংশ কে পৃথক পৃথকভাবে নির্দেশ করলে তাকে Noun of multitude বলে।",
                "একই দৈর্ঘ্য, পরিমাণ বা স্থান বুঝাতে যদি plural subject ব্যবহার হয় এমনকি উক্ত plural sub দ্বারা যদি নির্দিষ্ট পরিমাণ, দূরত্ব সময়, ওজন, ইত্যাদি অখন্ডভাবে বুঝায় তবে উক্ত বাক্যের verbটি singular হয়। <br/>i) 60 miles (to be) a long distance. <br/>60 miles is a long distance. <br/>ii) Ten maunds (to be) heavy weight. <br/>Ten maunds is a heavy weight. <br/>iii) Thirty dollars a week (not go) far. <br/>Thirty dollars a week does not go far.",
                "বাক্যের Sub যদি Infinitive, gerund, verbal noun, clause অথবা কোন phrase হয় তবে উক্ত বাক্যের verb টি singular হয়।<br/>i) Walking in the morning (to be) good for health. <br/>Walking in the morning is good for health. <br/>ii) To walk (to be) a good exercise. <br/>To walk is a good exerice. <br/>iii) The reading of book (to be) a good habit. <br/>The reading of book is a good habit.",
                "Relative pronoun এর পূর্বে ব্যবহৃত noun বা pronoun অনুসারে অর্থাৎ antecedent অনুসারে relative pronoun এর পরের verb বসে। <br/>i) It was I who (to have) done it. <br/>It was I who had done it. <br/>ii)This is the place where he (to born) <br/>This is the place where he borns. <br/>iii)It is I who (to be) responsible for this. <br/>It is I who am responsible for this. <br/>iv) These are the books that (to have) been lost. <br/>These are the books that have been lost.",
                "দেশের নাম বা বইয়ের নাম দেখতে plural হলেও তারা মূলত singular সুতরাং উক্ত বাক্যের verbটি singular হয়। <br/>i) Gulliver's travels (to be) a famous book. <br/>Gulliver's travels is a famous book. <br/>ii) Maldives (to be) a small country. <br/>Maldives is a small country. <br/>iii) The United States (to be) developed country. <br/>The united States is a developed country.",
                "কিছু কিছু noun আছে যাদের দেখতে মনে হয় plural কিন্তু প্রকৃতপক্ষে তারা singular সুতরাং উক্ত noun যুক্ত বাক্যের verbটিও হয় singular৷ singular noun গুলো হচ্ছে wages, news, gallows, politics, mathematics ইত্যাদি। <br/>i) Ill news (to run) a pace. <br/>Ill news runs a pace. <br/>ii) The wages of sin (to be) death. <br/>The wages of sin is death. <br/>iii) Gallows (to be) used to kill the criminal. <br/>Gallows is used to kill the criminal.",
                "কিছু কিছু noun আছে যাদের দেখতে মনে হয় singular কিন্তু প্রকৃতপক্ষে তারা plural সুতরাং উক্ত noun যুক্ত বাক্যের verbটিও হয় plural ৷ Noun গুলো হচ্ছে cattle, poultry, gentry, swine, public, police, people, clergy, nobility, peasantry, vermin ইত্যাদি। <br/>i) The cattle (to be) garzing in the field. <br/>The cattle are garzing in the field. <br/>ii) The clergy (to be) happy. <br/>The clergy are happy. <br/>iii) The public (to be) indifferent. <br/>The public are indifferent. <br/>iv) The police (to have) arrested the criminal. <br/>The police have arrested the criminal.",
                "Adjective এর কোন plural form নেই তবে Adjective এর পূর্বে the বসলে তা plural common noun হয় এবং ঐ বাক্যের verbটিও plural হয়। <br/>i) The poor (to be) born to suffer. <br/>The poor are born to suffer. <br/>ii) The pious (to have) been rewarded. <br/>The pious have been rewarded",
                "One third, two thirds, one fourth, two fourths, one fifth, two, fifths ইত্যাদির পর singular noun হলে, singular verb ঐ plural noun হলে, plural verb বসে। <br/>i) Two thirds of the students (to be) present. <br/>Two thirds of the students are present. <br/>ii) Three fourth of the book (to have) been read. <br/>Three fourth of the book has been read. <br/>iii) One fifth of the pages (to be) spoilt. <br/>One fifth of the pages are spoilt.",
                "কোন বাক্য যদি Introductory there দ্বারা শুরু হয় এবং তার পরে যদি singular noun থাকে তবে verbটি singular হয় এবং পরে যদি plural noun থাকে তবে plural verb বসে। <br/>i) There (to be) a high school in our village. <br/>There is a high school in our village. <br/>ii) There (to be) many students in our school. <br/>There are many students in our school. <br/>iii) There (to be) no birds or no animals in that area. <br/>There were no birds or no animals in that area.",
                "A large number এর পরের verbটি plural এবং the number এর পরে ব্যবহারিক verbটি singular হয়। <br/>i) A large number of boys (to be) present today. <br/>A large number of boys are present today <br/>ii) The number of the criminal (to be) arrested yesterday. <br/>The number of the criminal was arrested yesterday.  <br/> <br/>24. কোন noun এর পূর্বে যদি নির্দিষ্ট সংখ্যাবাচক বিশেষণ (Definite numeral adjective) যেমন : Dozen, gross, pair, hundred, thousand, score ইত্যাদি) থাকে তবে উক্ত বাক্যের Verbটি singular হয়। <br/>i) A pair of shoes (to be) on the table. <br/>A pair of shoes is on the table. <br/>ii) One dozen of bananas (to be) enough for me. <br/>One dozen of bananas is enough for me.<br/> <br/>25. A group of, A lot of, A half of ইত্যাদি বাক্যের প্রথমে বসলে বাক্যের verbটি plural হয় কিন্তু উক্ত phrase গুলো যদি বাক্যের মাঝে বসে তবে উক্ত বাক্যের verb singular হয়। <br/>i) Here is a lot of boys. <br/>Here is a lot of boys. <br/>ii) A group of boys (to be) enjoying the drama. <br/>A group of boys are enjoying the drama. <br/>iii) A lot of boys (to have) joined the party. <br/>A lot of boys have joined the party.",
                "বাক্যের subject যদি something, nothing, anything, everything ইত্যাদি হয় তবে উক্ত বাক্যের verb টি singular হয়। <br/>i) Everything (to be) clear to me. <br/>Everything is clear to me. <br/>ii) Nothing (to be) impossible. <br/>Nothing is impossible.",
                "Subject uncountable noun হলেও verb টি singular হতে পারে। <br/>i) Jute (to grow) in Bangladesh. <br/>Jute grows in Bangladesh. <br/>ii) His hair (to be) turning gray. <br/>His hair is turning gray. <br/>iii) Smoking (to be) a bad habit. <br/>Smoking is a bad habit.",
                "More than one এর পরের verb টি singular এবং more than two or three এর পরের verbটি plural হয় । <br/>i) More than a boy (to be) present. <br/>More than a boy is present. <br/>ii) More than three boys (to be) enjoying the drama. <br/>More than three boys are enjoying the drama.",
                "One of এর পরে noun টি plural হলেও verb টি singular হয়। <br/>i) One of the boys (to be) absent. <br/>One of the boys is absent.",
                "All এর পরে সাধারণত plural verb বসে তবে প্রবাদের ক্ষেত্রে All যুক্ত বাক্যের verb singular হয়। <br/>i) All (to be) happy. <br/>All are happy. <br/>ii) All's well that (to end) well. <br/>All's well that ends well. <br/>iii) All that glitters (to be) not gold. <br/>All that glitters is not gold.",
                "Arithmetical operations এর ক্ষেত্রে সাধারণত verb সমূহ singular হয়। তবে plural form এও লেখা যায়। <br/>i) Two and two (to be) four. <br/>Two and two is four. <br/>ii) Two times two (to be) four. <br/>Two times two is four. <br/>iii) Five and five (to make) ten. <br/>Five and five makes ten. <br/>Or, Five and five make ten."
            ]
        },
        {
            "title": "Practice-yourself",
            "serial": true,
            "dataSet": [
                "The captain and the Adjutant <b>(to have)</b> finished the meeting.",
                "The Headmaster and chairman <b>(to be)</b> present today.",
                "Rice and curry <b>(to be)</b> my only food.",
                "Jim and Della <b>(to be)</b> happy then.",
                "The legs of the chair <b>(to be)</b> broken.",
                "The wages of sin <b>(to be)</b> death.",
                "Ill news <b>(to run)</b> a pace.",
                "The peasantry <b>(to be)</b> helpless.",
                "Every man and every woman <b>(to have)</b> participated in the meeting.",
                "No boy and no girl <b>(to go)</b> there.",
                "She as well as her sisters <b>(to sing)</b> well.",
                "I along with my father <b>(to be)</b> enjoying the match.",
                "Neither he nor his friends <b>(to have)</b> played football.",
                "Not only Rina but also we <b>(to be)</b> pleased.",
                "The poor <b>(to live)</b> from hand to mouth.",
                "The honest <b>(to be)</b> respected everywhere.",
                "The public <b>(to be)</b> excited.",
                "Gold and silver <b>(to have)</b> I none.",
                "Rising early in the morning <b>(to be)</b> good. for health.",
                "Nobody <b>(to believe)</b> a liar.",
                "Mathematics <b>(to seem)</b> easy to me.",
                "These are books that <b>(to have)</b> been lost.",
                "It was you who <b>(to be)</b> guilty.",
                "This is he who <b>(to have)</b> done it.",
                "Philippines <b>(to be)</b> a poor country.",
                "50 miles <b>(to be)</b> a short distance.",
                "Twenty dollars a week (not go) far.",
                "Two plus two <b>(to be)</b> four.",
                "A group of doves <b>(to be)</b> flying.",
                "The Arabian Nights <b>(to be)</b> a most popular drama series.",
                "Karim, you and I <b>(to be)</b> to blame.",
                "1, Karim and you <b>(to have)</b> finished the work.",
                "The jury <b>(to be)</b> divided in their opinion.",
                "Many of the boys <b>(to be)</b> playing.",
                "The driving of a car <b>(to be)</b> very easy.",
                "All swine <b>(to be)</b> dirty beasts.",
                "One third of the boys <b>(to be)</b> present.",
                "More than forty boys <b>(to be)</b> playing in the field.",
                "He who works hard <b>(to prosper)</b> in life.",
                "Each of them <b>(to be)</b> coming.",
                "The police <b>(to be)</b> patrolling in the city street.",
                "My belongings <b>(to be)</b> packed up in suitcases.",
                "My savings <b>(to be)</b> in the bank.",
                "The remains of the meal <b>(to be)</b> thrown in the bin.",
                "A large number of boys <b>(to be)</b> making a noise.",
                "The number of cows <b>(to be)</b> grazing.",
                "Two-thirds of the students <b>(to be)</b> enjoying game.",
                "There <b>(to be)</b> many tigers in the Sundarbans.",
                "Everybody <b>(to hate)</b> a liar."
            ]
        },
        {
            "title": "Exercise A. Subject এর সাথে সামঞ্জস্য রেখে শূন্যস্থানে যথার্থ verbটি বসাও :",
            "serial": true,
            "dataSet": [
                "Two and two <b>___</b> four. <b>(makes/make)</b>",
                "Rice as well as jute <b>___</b> grown in Bangladesh. <b>(is/are)</b>",
                "Bread and butter <b>___</b> wholesome food. <b>(is/are)</b>",
                "Twenty kilometers <b>___</b> a long distance. <b>(is/are)</b>",
                "No news  good news. <b>(is/are)</b>",
                "Each of them <b>___</b> fined. <b>(is/are)</b>",
                "The quality of the fruits <b>___</b> not good. <b>(is/are)</b>",
                "The great poet and novelist dead. <b>(is/are)</b>",
                "Two-thirds of the city___ affected. <b>(is/are)</b>",
                "Neither of them <b>___</b> famous in the country. <b>(is/are)</b>",
                "The Headmaster and secretary <b>___</b> present today. <b>(is/are)</b>",
                "The Headmaster and the secretary <b>___</b> present today<b>.(is/are)</b>",
                "It is I who _ to blame. <b>(am/is)</b>",
                "It is he who _ to blame. <b>(are/is)</b>",
                "It is you who <b>___</b> to blame. <b>(are/is)</b>",
                "Slow and steady-- the rice. <b>(win/wins)</b>",
                "He and I _ well. <b>(am/are)</b>",
                "Time and tide _ for no one. <b>(wait/waits)</b>",
                "Many a boy _ done the job. <b>(has/have)</b>",
                "The public _ not admitted. <b>(is/are)</b>",
                "The majority <b>___</b> against this. <b>(is/are)</b>",
                "The mob -- dispersed. <b>(has/have)</b>",
                "The gentry <b>___</b> admitted here. <b>(is/are)</b>",
                "Gold and silver <b>___</b> precious metals. <b>(is/are)</b>",
                "All <b>___</b> drowned. <b>(was/were)</b>",
                "All that glitters <b>___</b> not gold. <b>(is/are)</b>",
                "None but fools <b>___</b> ever believed it. <b>(has/have)</b>",
                "None of his poems <b>___</b> well-known. <b>(is/are)</b>",
                "The military <b>___</b> called out. <b>(was/were)</b>",
                "Some <b>___</b> born great. <b>(is/are)</b>"
            ]
        },
        {
            "title": "Exercise B. Fill in the blanks with the suitable verbs:",
            "serial": true,
            "dataSet": [
                "No book and no furniture saved <b>___</b> a big sum.",
                "Ten thousand taka <b>___</b> a big sum.",
                "Either you or your brother <b>___</b> done this.",
                "Neither he nor I <b>___</b> there.",
                "Either Rekha or her daughters <b>___</b> done this.",
                "Either he or I <b>___</b> to go.",
                "Neither you nor he <b>___</b> to blame.",
                "Neither of the girls <b>___</b> guilty.",
                "Either of the two boys <b>___</b> to come here.",
                "The boy and not his parents <b>___</b> to do this.",
                "Rahman, with his friends <b>___</b> punished.",
                "The teacher as well as the students <b>___</b> present.",
                "More than one girl <b>___</b> present there.",
                "You, he and I <b>___</b> friends."
            ]
        },
        {
            "title": "Ans:",
            "serial": false,
            "dataSet": [
                "<b>Q(A):</b>",
                "<b>1.</b> make, <b>2.</b> is, <b>3.</b> is, <b>4.</b> is, <b>5.</b> is, <b>6.</b> is, <b>7.</b> is, <b>8.</b> is, <b>9.</b> is, <b>10.</b> is, <b>11.</b> is, <b>12.</b> are, <b>13.</b> am, <b>14.</b> is, <b>15.</b> are, <b>16.</b> wins, <b>17.</b> are, <b>18.</b> waits, <b>19.</b> has, <b>20.</b> are, <b>21.</b> is, <b>22.</b> has, <b>23.</b> are, <b>24.</b> are, <b>25.</b> were, <b>26.</b> is, <b>27.</b> have, <b>28.</b> are, <b>29.</b> were, <b>30.</b> are.",
                "<b>Q(B):</b>",
                "<b>1.</b> was, <b>2.</b> is, <b>3.</b> has, <b>4.</b> was, <b>5.</b> have, <b>6.</b> am, <b>7.</b> is, <b>8.</b> is, <b>9.</b> is, <b>10.</b> has, <b>11.</b> was, <b>12.</b> was, <b>13.</b> was, <b>14.</b> are."
            ]
        }
    ]
}